Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX2051MTC128.atdf
        <module name="RTC" id="04575" version="G">
          <instance name="RTC">
            <register-group address-space="base" name="RTC" name-in-module="RTC" offset="0x40053100"/>
            <parameters>
              <param name="INSTANCE_ID" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="RTT" id="6081" version="Q">
          <instance name="RTT">
            <register-group address-space="base" name="RTT" name-in-module="RTT" offset="0x40053020"/>
            <parameters>
              <param name="INSTANCE_ID" value="3"/>
            </parameters>
          </instance>
        </module>
        <module name="SEFC" id="04463" version="F">
          <instance name="SEFC0">
            <register-group address-space="base" name="SEFC0" name-in-module="SEFC" offset="0x460E0000"/>
            <parameters>
              <param name="INSTANCE_ID" value="7"/>
            </parameters>
          </instance>
          <instance name="SEFC1">
            <register-group address-space="base" name="SEFC1" name-in-module="SEFC" offset="0x460E0200"/>
            <parameters>
              <param name="INSTANCE_ID" value="8"/>
            </parameters>
          </instance>
        </module>
        <module name="SFR" id="04478" version="D">
          <instance name="SFR">
            <register-group address-space="base" name="SFR" name-in-module="SFR" offset="0x40050400"/>
          </instance>
        </module>
        <module name="SFRBU" id="04479" version="A">
          <instance name="SFRBU">
            <register-group address-space="base" name="SFRBU" name-in-module="SFRBU" offset="0x40050600"/>
          </instance>
        </module>
        <module name="SHA" id="6156" version="S">
          <instance name="SHA">
            <register-group address-space="base" name="SHA" name-in-module="SHA" offset="0x44008000"/>
            <parameters>
              <param name="INSTANCE_ID" value="53"/>
              <param name="CLOCK_ID" value="53"/>
              <param name="INSTANCE_ID_SHASEC" value="54"/>
            </parameters>
          </instance>
        </module>
        <module name="SLCDC" id="6259" version="K">
          <instance name="SLCDC">
            <register-group address-space="base" name="SLCDC" name-in-module="SLCDC" offset="0x40030000"/>
            <parameters>
              <param name="INSTANCE_ID" value="29"/>
            </parameters>
            <signals>
              <signal pad="PA21" function="A" group="COM" index="0"/>
              <signal pad="PA22" function="A" group="COM" index="1"/>
              <signal pad="PA23" function="A" group="COM" index="2"/>
              <signal pad="PA24" function="A" group="COM" index="3"/>
              <signal pad="PA25" function="A" group="COM" index="4"/>
              <signal pad="PA26" function="A" group="COM" index="5"/>
              <signal pad="PA27" function="A" group="COM" index="6"/>
              <signal pad="PA28" function="A" group="COM" index="7"/>
              <signal pad="PA29" function="A" group="SEG" index="0"/>
              <signal pad="PA30" function="A" group="SEG" index="1"/>
              <signal pad="PA31" function="A" group="SEG" index="2"/>
              <signal pad="PB0" function="A" group="SEG" index="3"/>
              <signal pad="PB1" function="A" group="SEG" index="4"/>
              <signal pad="PB2" function="A" group="SEG" index="5"/>
              <signal pad="PB3" function="A" group="SEG" index="6"/>
              <signal pad="PB4" function="A" group="SEG" index="7"/>
              <signal pad="PB5" function="A" group="SEG" index="8"/>
              <signal pad="PB6" function="A" group="SEG" index="9"/>
              <signal pad="PB7" function="A" group="SEG" index="10"/>
              <signal pad="PB8" function="A" group="SEG" index="11"/>
              <signal pad="PB9" function="A" group="SEG" index="12"/>
              <signal pad="PB10" function="A" group="SEG" index="13"/>
              <signal pad="PB11" function="A" group="SEG" index="14"/>
              <signal pad="PB12" function="A" group="SEG" index="15"/>
              <signal pad="PB13" function="A" group="SEG" index="16"/>
              <signal pad="PB14" function="A" group="SEG" index="17"/>
              <signal pad="PB15" function="A" group="SEG" index="18"/>
              <signal pad="PB16" function="A" group="SEG" index="19"/>
              <signal pad="PB17" function="A" group="SEG" index="20"/>
              <signal pad="PB18" function="A" group="SEG" index="21"/>
              <signal pad="PB19" function="A" group="SEG" index="22"/>
              <signal pad="PB20" function="A" group="SEG" index="23"/>
              <signal pad="PB21" function="A" group="SEG" index="24"/>
              <signal pad="PB22" function="A" group="SEG" index="25"/>
              <signal pad="PB23" function="A" group="SEG" index="26"/>
              <signal pad="PB24" function="A" group="SEG" index="27"/>
              <signal pad="PB25" function="A" group="SEG" index="28"/>
              <signal pad="PB26" function="A" group="SEG" index="29"/>
              <signal pad="PC0" function="A" group="SEG" index="30"/>
              <signal pad="PC1" function="A" group="SEG" index="31"/>
            </signals>
          </instance>
        </module>
        <module name="SUPC" id="04670" version="E">
          <instance name="SUPC">
            <register-group address-space="base" name="SUPC" name-in-module="SUPC" offset="0x400531D0"/>
            <parameters>
              <param name="INSTANCE_ID" value="0"/>
              <param name="INSTANCE_ID_WKUP3" value="62"/>
              <param name="INSTANCE_ID_WKUP4" value="63"/>
              <param name="INSTANCE_ID_WKUP5" value="64"/>
              <param name="INSTANCE_ID_WKUP6" value="65"/>
              <param name="INSTANCE_ID_WKUP7" value="66"/>
              <param name="INSTANCE_ID_WKUP8" value="67"/>
              <param name="INSTANCE_ID_WKUP9" value="68"/>
              <param name="INSTANCE_ID_WKUP10" value="69"/>
              <param name="INSTANCE_ID_WKUP11" value="70"/>
              <param name="INSTANCE_ID_WKUP12" value="71"/>
              <param name="INSTANCE_ID_WKUP13" value="72"/>
              <param name="INSTANCE_ID_WKUP14" value="73"/>
              <param name="INSTANCE_ID_WKUP15" value="74"/>
            </parameters>
            <signals>
              <signal pad="PA2" function="X1" group="WKUP" index="3"/>
              <signal pad="PA3" function="X1" group="WKUP" index="4"/>
              <signal pad="PA5" function="X1" group="WKUP" index="5"/>
              <signal pad="PA9" function="X1" group="WKUP" index="6"/>
              <signal pad="PA13" function="X1" group="WKUP" index="7"/>
              <signal pad="PB9" function="X1" group="WKUP" index="9"/>
              <signal pad="PB12" function="X1" group="WKUP" index="10"/>
              <signal pad="PB25" function="X1" group="WKUP" index="8"/>
              <signal pad="PC7" function="X1" group="WKUP" index="11"/>
              <signal pad="PC9" function="X1" group="WKUP" index="12"/>
              <signal pad="PC14" function="X1" group="WKUP" index="13"/>
              <signal pad="PC21" function="X1" group="WKUP" index="14"/>
            </signals>
          </instance>
        </module>
        <module name="SYSCWP" id="04675" version="C">
          <instance name="SYSCWP">
            <register-group address-space="base" name="SYSCWP" name-in-module="SYSCWP" offset="0x400531A0"/>
