Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX2051MTC128.atdf
      <value-group caption="Write Protection Key" name="ICM_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN, WPITEN and WPCREN bits. Always reads as 0" name="PASSWD" value="0x49434D"/>
      </value-group>
    </module>
    <module caption="Inter-processor Communication" name="IPC" id="11204" version="D">
      <register-group name="IPC">
        <register caption="Interrupt Set Command Register" name="IPC_ISCR" offset="0x000" rw="W" size="4">
          <bitfield caption="Interrupt Set" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Set" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Set" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Set" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Set" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Set" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Set" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Set" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Set" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Set" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Set" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Set" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Set" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Set" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Set" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Set" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Set" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Set" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Set" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Set" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Set" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Set" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Set" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Set" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Set" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Set" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Set" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Set" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Set" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Set" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Set" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Set" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Interrupt Clear Command Register" name="IPC_ICCR" offset="0x004" rw="W" size="4">
          <bitfield caption="Interrupt Clear" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Clear" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Clear" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Clear" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Clear" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Clear" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Clear" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Clear" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Clear" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Clear" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Clear" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Clear" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Clear" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Clear" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Clear" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Clear" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Clear" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Clear" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Clear" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Clear" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Clear" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Clear" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Clear" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Clear" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Clear" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Clear" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Clear" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Clear" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Clear" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Clear" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Clear" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Clear" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Interrupt Pending Register" name="IPC_IPR" offset="0x008" rw="R" size="4">
          <bitfield caption="Interrupt Pending" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Pending" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Pending" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Pending" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Pending" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Pending" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Pending" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Pending" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Pending" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Pending" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Pending" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Pending" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Pending" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Pending" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Pending" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Pending" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Pending" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Pending" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Pending" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Pending" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Pending" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Pending" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Pending" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Pending" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Pending" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Pending" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Pending" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Pending" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Pending" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Pending" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Pending" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Pending" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Interrupt Enable Command Register" name="IPC_IECR" offset="0x00C" rw="W" size="4">
          <bitfield caption="Interrupt Enable" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Enable" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Enable" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Enable" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Enable" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Enable" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Enable" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Enable" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Enable" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Enable" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Enable" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Enable" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Enable" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Enable" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Enable" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Enable" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Enable" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Enable" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Enable" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Enable" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Enable" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Enable" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Enable" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Enable" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Enable" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Enable" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Enable" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Enable" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Enable" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Enable" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Enable" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Enable" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Interrupt Disable Command Register" name="IPC_IDCR" offset="0x010" rw="W" size="4">
          <bitfield caption="Interrupt Disable" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Disable" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Disable" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Disable" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Disable" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Disable" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Disable" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Disable" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Disable" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Disable" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Disable" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Disable" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Disable" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Disable" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Disable" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Disable" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Disable" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Disable" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Disable" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Disable" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Disable" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Disable" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Disable" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Disable" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Disable" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Disable" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Disable" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Disable" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Disable" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Disable" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Disable" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Disable" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Interrupt Mask Register" name="IPC_IMR" offset="0x014" rw="R" size="4">
          <bitfield caption="Interrupt Mask" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Interrupt Mask" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Interrupt Mask" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Interrupt Mask" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Interrupt Mask" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Interrupt Mask" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Interrupt Mask" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Interrupt Mask" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Interrupt Mask" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Interrupt Mask" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Interrupt Mask" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Interrupt Mask" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Interrupt Mask" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Interrupt Mask" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Interrupt Mask" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Interrupt Mask" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Interrupt Mask" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Interrupt Mask" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Interrupt Mask" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Interrupt Mask" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Interrupt Mask" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Interrupt Mask" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Interrupt Mask" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Interrupt Mask" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Interrupt Mask" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Interrupt Mask" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Interrupt Mask" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Interrupt Mask" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Interrupt Mask" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Interrupt Mask" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Interrupt Mask" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Interrupt Mask" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Interrupt Status Register" name="IPC_ISR" offset="0x018" rw="R" size="4">
          <bitfield caption="Current Interrupt Identifier" mask="0x00000001" name="IRQ0"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000002" name="IRQ1"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000004" name="IRQ2"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000008" name="IRQ3"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000010" name="IRQ4"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000020" name="IRQ5"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000040" name="IRQ6"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000080" name="IRQ7"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000100" name="IRQ8"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000200" name="IRQ9"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000400" name="IRQ10"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00000800" name="IRQ11"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00001000" name="IRQ12"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00002000" name="IRQ13"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00004000" name="IRQ14"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00008000" name="IRQ15"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00010000" name="IRQ16"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00020000" name="IRQ17"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00040000" name="IRQ18"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00080000" name="IRQ19"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00100000" name="IRQ20"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00200000" name="IRQ21"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00400000" name="IRQ22"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x00800000" name="IRQ23"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x01000000" name="IRQ24"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x02000000" name="IRQ25"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x04000000" name="IRQ26"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x08000000" name="IRQ27"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x10000000" name="IRQ28"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x20000000" name="IRQ29"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x40000000" name="IRQ30"/>
          <bitfield caption="Current Interrupt Identifier" mask="0x80000000" name="IRQ31"/>
        </register>
        <register caption="Write Protection Mode Register" name="IPC_WPMR" offset="0x01C" rw="RW" size="4">
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="IPC_WPMR__WPKEY"/>
        </register>
      </register-group>
      <value-group caption="Write Protection Key" name="IPC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x495043"/>
      </value-group>
    </module>
    <module caption="AHB Bus Matrix" name="MATRIX" id="6342" version="J">
      <register-group name="MATRIX_PR" size="8">
        <register caption="Priority Register A for Slave 0" name="MATRIX_PRAS" offset="0x0" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 0" mask="0x00000004" name="LQOSEN0"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 1" mask="0x00000040" name="LQOSEN1"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 2" mask="0x00000400" name="LQOSEN2"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 3" mask="0x00004000" name="LQOSEN3"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 4" mask="0x00040000" name="LQOSEN4"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 5" mask="0x00400000" name="LQOSEN5"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 6" mask="0x04000000" name="LQOSEN6"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 7" mask="0x40000000" name="LQOSEN7"/>
        </register>
        <register caption="Priority Register B for Slave 0" name="MATRIX_PRBS" offset="0x4" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 8" mask="0x00000004" name="LQOSEN8"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 9" mask="0x00000040" name="LQOSEN9"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 10" mask="0x00000400" name="LQOSEN10"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 11" mask="0x00004000" name="LQOSEN11"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 12" mask="0x00040000" name="LQOSEN12"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 13" mask="0x00400000" name="LQOSEN13"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 14" mask="0x04000000" name="LQOSEN14"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
          <bitfield caption="Latency Quality of Service Enable for Master 15" mask="0x40000000" name="LQOSEN15"/>
        </register>
      </register-group>
      <register-group name="MATRIX">
        <register caption="Master Configuration Register" name="MATRIX_MCFG" offset="0x0000" rw="RW" size="4" count="16">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT" values="MATRIX_MCFG__ULBT"/>
        </register>
