Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX2051MTC128.atdf
      <value-group caption="PIO Line 17 Mask" name="PIO_MSKR0__MSK17">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 18 Mask" name="PIO_MSKR0__MSK18">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 19 Mask" name="PIO_MSKR0__MSK19">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 20 Mask" name="PIO_MSKR0__MSK20">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 21 Mask" name="PIO_MSKR0__MSK21">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 22 Mask" name="PIO_MSKR0__MSK22">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 23 Mask" name="PIO_MSKR0__MSK23">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 24 Mask" name="PIO_MSKR0__MSK24">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 25 Mask" name="PIO_MSKR0__MSK25">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 26 Mask" name="PIO_MSKR0__MSK26">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 27 Mask" name="PIO_MSKR0__MSK27">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 28 Mask" name="PIO_MSKR0__MSK28">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 29 Mask" name="PIO_MSKR0__MSK29">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 30 Mask" name="PIO_MSKR0__MSK30">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="PIO Line 31 Mask" name="PIO_MSKR0__MSK31">
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx does not affect the corresponding I/O line configuration." name="DISABLED" value="0"/>
        <value caption="Writing the PIO_CFGRx, PIO_ODSRx or PIO_IOFRx updates the corresponding I/O line configuration." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="I/O Line Function" name="PIO_CFGR__FUNC">
        <value caption="Select the PIO mode for the selected I/O lines." name="GPIO" value="0x0"/>
        <value caption="Select the peripheral A for the selected I/O lines." name="PERIPH_A" value="0x1"/>
        <value caption="Select the peripheral B for the selected I/O lines." name="PERIPH_B" value="0x2"/>
        <value caption="Select the peripheral C for the selected I/O lines." name="PERIPH_C" value="0x3"/>
        <value caption="Select the peripheral D for the selected I/O lines." name="PERIPH_D" value="0x4"/>
      </value-group>
      <value-group caption="Direction" name="PIO_CFGR__DIR">
        <value caption="The selected I/O lines are pure inputs." name="INPUT" value="0"/>
        <value caption="The selected I/O lines are enabled in output." name="OUTPUT" value="1"/>
      </value-group>
      <value-group caption="Pull-Up Enable" name="PIO_CFGR__PUEN">
        <value caption="Pull-Up is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="Pull-Up is enabled for the selected I/O lines." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Pull-Down Enable" name="PIO_CFGR__PDEN">
        <value caption="Pull-Down is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="Pull-Down is enabled for the selected I/O lines only if PUEN is 0." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Input Filter Enable" name="PIO_CFGR__IFEN">
        <value caption="The input filter is disabled for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="The input filter is enabled for the selected I/O lines." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Input Filter Slow Clock Enable" name="PIO_CFGR__IFSCEN">
        <value caption="The glitch filter is able to filter glitches with a duration &lt; tmck/2 for the selected I/O lines." name="DISABLED" value="0"/>
        <value caption="The debouncing filter is able to filter pulses with a duration &lt; tdiv_slck/2 for the selected I/O lines." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Open-Drain" name="PIO_CFGR__OPD">
        <value caption="The open-drain is disabled for the selected I/O lines. I/O lines are driven at high- and low-level." name="DISABLED" value="0"/>
        <value caption="The open-drain is enabled for the selected I/O lines. I/O lines are driven at low-level only." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="Schmitt Trigger" name="PIO_CFGR__SCHMITT">
        <value caption="Schmitt trigger is enabled for the selected I/O lines." name="ENABLED" value="0"/>
        <value caption="Schmitt trigger is disabled for the selected I/O lines." name="DISABLED" value="1"/>
      </value-group>
      <value-group caption="Slew Rate" name="PIO_CFGR__SLEWRATE">
        <value caption="Fast slew rate" name="FAST" value="0x0"/>
        <value caption="Medium-fast slew rate" name="MEDIUMFAST" value="0x1"/>
        <value caption="Medium slew rate" name="MEDIUM" value="0x2"/>
        <value caption="Slow slew rate" name="SLOW" value="0x3"/>
      </value-group>
