Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX2051MTC128.atdf
      <value-group caption="I/O Security Status" name="PIO_P_IOSSR0__P31">
        <value caption="The I/O line of the I/O group 0 is in Privileged-Access mode." name="PRIVILEGED_ACCESS" value="0"/>
        <value caption="The I/O line of the I/O group 0 is in User-Access mode." name="USER_ACCESS" value="1"/>
      </value-group>
      <value-group caption="Freeze Key" name="PIO_P_IOFR0__FRZKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit." name="PASSWD" value="0x494F46"/>
      </value-group>
      <value-group caption="Write Protection Key" name="PIO_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x50494F"/>
      </value-group>
      <value-group caption="Write Protection Key" name="PIO_P_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of WPEN. Always reads as 0." name="PASSWD" value="0x50494F"/>
      </value-group>
    </module>
    <module caption="Power Management Controller" name="PMC" id="44171" version="I">
      <register-group name="PMC">
        <register caption="System Clock Enable Register" name="PMC_SCER" offset="0x0000" rw="W" size="4">
          <bitfield caption="Programmable Clock 0 Output Enable" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Enable" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Enable" mask="0x00000400" name="PCK2"/>
          <bitfield caption="Programmable Clock 3 Output Enable" mask="0x00000800" name="PCK3"/>
          <bitfield caption="Coprocessor (Second Processor) Clocks Enable" mask="0x00010000" name="CPCK"/>
          <bitfield caption="Coprocessor Bus Master Clocks Enable" mask="0x00020000" name="CPBMCK"/>
          <bitfield caption="Coprocessor Clocks Enable Key" mask="0x00F00000" name="CPKEY" values="PMC_SCER__CPKEY"/>
        </register>
        <register caption="System Clock Disable Register" name="PMC_SCDR" offset="0x0004" rw="W" size="4">
          <bitfield caption="Programmable Clock 0 Output Disable" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Disable" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Disable" mask="0x00000400" name="PCK2"/>
          <bitfield caption="Programmable Clock 3 Output Disable" mask="0x00000800" name="PCK3"/>
          <bitfield caption="Coprocessor (Second Processor) Clocks Disable" mask="0x00010000" name="CPCK"/>
          <bitfield caption="Coprocessor Bus Master Clocks Disable" mask="0x00020000" name="CPBMCK"/>
          <bitfield caption="Coprocessor Clocks Enable Key" mask="0x00F00000" name="CPKEY" values="PMC_SCDR__CPKEY"/>
        </register>
        <register caption="System Clock Status Register" name="PMC_SCSR" offset="0x0008" rw="R" size="4">
          <bitfield caption="CPU_CLK Status for Core 0" mask="0x00000001" name="CPU_CLK0S"/>
          <bitfield caption="CPU_CLK Status for Core 1" mask="0x00000002" name="CPU_CLK1S"/>
          <bitfield caption="Programmable Clock 0 Output Status" mask="0x00000100" name="PCK0"/>
          <bitfield caption="Programmable Clock 1 Output Status" mask="0x00000200" name="PCK1"/>
          <bitfield caption="Programmable Clock 2 Output Status" mask="0x00000400" name="PCK2"/>
          <bitfield caption="Programmable Clock 3 Output Status" mask="0x00000800" name="PCK3"/>
          <bitfield caption="Coprocessor (Second Processor) Clocks Status" mask="0x00010000" name="CPCK"/>
          <bitfield caption="Coprocessor Bus Master Clocks Status" mask="0x00020000" name="CPBMCK"/>
        </register>
        <register caption="PLL Control Register 0" name="PMC_PLL_CTRL0" offset="0x000C" rw="RW" size="4">
          <bitfield caption="Divider for PMC output 0" mask="0x000000FF" name="DIVPMC0"/>
          <bitfield caption="Divider for PMC output 1 (PLLA only)" mask="0x000FF000" name="DIVPMC1"/>
          <bitfield caption="PLL Multiplexer Select" mask="0x08000000" name="PLLMS"/>
          <bitfield caption="Enable PLL" mask="0x10000000" name="ENPLL"/>
          <bitfield caption="Enable PLL Clock Output 0" mask="0x20000000" name="ENPLLO0"/>
          <bitfield caption="Enable PLL Clock Output 1 (PLLA only)" mask="0x40000000" name="ENPLLO1"/>
          <bitfield caption="Enable PLL Lock" mask="0x80000000" name="ENLOCK"/>
        </register>
        <register caption="PLL Control Register 1" name="PMC_PLL_CTRL1" offset="0x0010" rw="RW" size="4">
          <bitfield caption="Multiplier Factor Value for PLLA, B and C" mask="0x0000FFFF" name="MUL"/>
        </register>
        <register caption="PLL Control Register 2" name="PMC_PLL_CTRL2" offset="0x0014" rw="RW" size="4">
          <bitfield caption="Fractional Loop Divider Setting" mask="0x003FFFFF" name="FRACR"/>
        </register>
        <register caption="PLL Spread Spectrum Register" name="PMC_PLL_SSR" offset="0x0018" rw="RW" size="4">
          <bitfield caption="Spread Spectrum Step Size" mask="0x0000FFFF" name="STEP"/>
          <bitfield caption="Spread Spectrum Number of Step" mask="0x00FF0000" name="NSTEP"/>
          <bitfield caption="Spread Spectrum Enable" mask="0x10000000" name="ENSPREAD"/>
        </register>
        <register caption="PLL Analog Control Register" name="PMC_PLL_ACR" offset="0x001C" rw="RW" size="4">
          <bitfield caption="PLL Control Value Selection" mask="0x00000FFF" name="CONTROL"/>
          <bitfield caption="PLL Lock Threshold Value Selection" mask="0x00FF0000" name="LOCK_THR"/>
          <bitfield caption="PLL Loop Filter Selection" mask="0xFF000000" name="LOOP_FILTER"/>
        </register>
        <register caption="PLL Update Register" name="PMC_PLL_UPDT" offset="0x0020" rw="RW" size="4">
          <bitfield caption="PLL ID" mask="0x0000000F" name="ID"/>
          <bitfield caption="PLL Setting Update (write-only)" mask="0x00000100" name="UPDATE"/>
          <bitfield caption="Start-up Time" mask="0x00FF0000" name="STUPTIM"/>
        </register>
        <register caption="Main Oscillator Register" name="CKGR_MOR" offset="0x0024" rw="RW" size="4">
          <bitfield caption="Main Crystal Oscillator Enable" mask="0x00000001" name="MOSCXTEN"/>
          <bitfield caption="12 to 48 MHz Crystal Oscillator Bypass" mask="0x00000002" name="MOSCXTBY"/>
          <bitfield caption="Wait Mode Command (write-only)" mask="0x00000004" name="WAITMODE"/>
          <bitfield caption="Main RC Oscillator Enable" mask="0x00000008" name="MOSCRCEN"/>
          <bitfield caption="Main Crystal Oscillator Start-up Time" mask="0x0000FF00" name="MOSCXTST"/>
          <bitfield caption="Write Access Password" mask="0x00FF0000" name="KEY" values="CKGR_MOR__KEY"/>
          <bitfield caption="Main Clock Oscillator Selection" mask="0x01000000" name="MOSCSEL" values="CKGR_MOR__MOSCSEL"/>
          <bitfield caption="Clock Failure Detector Enable" mask="0x02000000" name="CFDEN"/>
          <bitfield caption="32.768 kHz Crystal Oscillator Frequency Monitoring Enable" mask="0x04000000" name="XT32KFME"/>
          <bitfield caption="Bad MCK0 Clock Reset Enable" mask="0x08000000" name="BMCKRST"/>
        </register>
