Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX2051MTC128.atdf
      <value-group caption="Processor (CPU_CLK0) and Master Clock (MCK0) Prescaler" name="PMC_CPU_CKR__PRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x2"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x3"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0x4"/>
        <value caption="Selected clock divided by 32" name="CLK_32" value="0x5"/>
        <value caption="Selected clock divided by 64" name="CLK_64" value="0x6"/>
        <value caption="Selected clock divided by 3" name="CLK_3" value="0x7"/>
      </value-group>
      <value-group caption="Coprocessor MCK1 Source Selection" name="PMC_CPU_CKR__CPCSS">
        <value caption="MD_SLCK is selected" name="MD_SLOW_CLK" value="0x0"/>
        <value caption="MAINCK is selected" name="MAINCK" value="0x1"/>
        <value caption="MCK0 is selected" name="MCK0" value="0x2"/>
        <value caption="PLLACK1 is selected" name="PLLACK1" value="0x3"/>
        <value caption="PLLBCK is selected" name="PLLBCK" value="0x4"/>
        <value caption="PLLCCK is selected" name="PLLCCK" value="0x5"/>
      </value-group>
      <value-group caption="Coprocessor MCK1 Prescaler" name="PMC_CPU_CKR__CPPRES">
        <value caption="Selected clock" name="CLK_1" value="0x0"/>
        <value caption="Selected clock divided by 2" name="CLK_2" value="0x1"/>
        <value caption="Selected clock divided by 3" name="CLK_3" value="0x2"/>
        <value caption="Selected clock divided by 4" name="CLK_4" value="0x3"/>
        <value caption="Selected clock divided by 5" name="CLK_5" value="0x4"/>
        <value caption="Selected clock divided by 6" name="CLK_6" value="0x5"/>
        <value caption="Selected clock divided by 7" name="CLK_7" value="0x6"/>
        <value caption="Selected clock divided by 8" name="CLK_8" value="0x7"/>
        <value caption="Selected clock divided by 9" name="CLK_9" value="0x8"/>
        <value caption="Selected clock divided by 10" name="CLK_10" value="0x9"/>
        <value caption="Selected clock divided by 11" name="CLK_11" value="0xA"/>
        <value caption="Selected clock divided by 12" name="CLK_12" value="0xB"/>
        <value caption="Selected clock divided by 13" name="CLK_13" value="0xC"/>
        <value caption="Selected clock divided by 14" name="CLK_14" value="0xD"/>
        <value caption="Selected clock divided by 15" name="CLK_15" value="0xE"/>
        <value caption="Selected clock divided by 16" name="CLK_16" value="0xF"/>
      </value-group>
      <value-group caption="Programmable Clock Source Selection" name="PMC_PCK__CSS">
        <value caption="MD_SLCK is selected" name="MD_SLOW_CLK" value="0x0"/>
        <value caption="TD_SLCK is selected" name="TD_SLOW_CLOCK" value="0x1"/>
        <value caption="MAINCK is selected" name="MAINCK" value="0x2"/>
        <value caption="MCK0 is selected" name="MCK0" value="0x3"/>
        <value caption="PLLACK1 is selected." name="PLLACK1" value="0x4"/>
        <value caption="PLLBCK is selected." name="PLLBCK" value="0x5"/>
        <value caption="PLLCCK is selected." name="PLLCCK" value="0x6"/>
        <value caption="PLLCSRC is selected." name="PLLCSRC" value="0x7"/>
      </value-group>
      <value-group caption="Flash Low-power Mode" name="PMC_FSMR__FLPM">
        <value caption="Flash is in Standby Mode when system enters Wait Mode" name="FLASH_STANDBY" value="0x0"/>
        <value caption="Flash is in Deep-powerdown mode when system enters Wait Mode" name="FLASH_DEEP_POWERDOWN" value="0x1"/>
        <value caption="Idle mode" name="FLASH_IDLE" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Key" name="PMC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x504D43"/>
      </value-group>
      <value-group caption="Generic Clock Source Selection" name="PMC_PCR__GCLKCSS">
        <value caption="MD_SLCK is selected" name="MD_SLOW_CLK" value="0x0"/>
        <value caption="TD_SLCK is selected" name="TD_SLOW_CLOCK" value="0x1"/>
        <value caption="MAINCK is selected" name="MAINCK" value="0x2"/>
        <value caption="MCK0 is selected" name="MCK0" value="0x3"/>
        <value caption="PLLACK1 is selected." name="PLLACK1" value="0x4"/>
        <value caption="PLLBCK is selected." name="PLLBCK" value="0x5"/>
        <value caption="PLLCCK is selected." name="PLLCCK" value="0x6"/>
        <value caption="PLLCSRC is selected." name="PLLCSRC" value="0x7"/>
      </value-group>
    </module>
    <module caption="Pulse Width Modulation Controller" name="PWM" id="6343" version="ZM">
      <register-group name="PWM_CH_NUM" size="32">
        <register caption="PWM Channel Mode Register" name="PWM_CMR" offset="0x0" rw="RW" size="4">
          <bitfield caption="Channel Prescaler" mask="0x0000000F" name="CPRE" values="PWM_CMR__CPRE"/>
          <bitfield caption="Channel Alignment" mask="0x00000100" name="CALG" values="PWM_CMR__CALG"/>
          <bitfield caption="Channel Polarity" mask="0x00000200" name="CPOL" values="PWM_CMR__CPOL"/>
          <bitfield caption="Counter Event Selection" mask="0x00000400" name="CES" values="PWM_CMR__CES"/>
          <bitfield caption="Update Selection" mask="0x00000800" name="UPDS" values="PWM_CMR__UPDS"/>
          <bitfield caption="Disabled Polarity Inverted" mask="0x00001000" name="DPOLI"/>
          <bitfield caption="Timer Counter Trigger Selection" mask="0x00002000" name="TCTS"/>
          <bitfield caption="Dead-Time Generator Enable" mask="0x00010000" name="DTE"/>
          <bitfield caption="Dead-Time PWMHx Output Inverted" mask="0x00020000" name="DTHI"/>
          <bitfield caption="Dead-Time PWMLx Output Inverted" mask="0x00040000" name="DTLI"/>
          <bitfield caption="Push-Pull Mode" mask="0x00080000" name="PPM"/>
        </register>
        <register caption="PWM Channel Duty Cycle Register" name="PWM_CDTY" offset="0x4" rw="RW" size="4">
          <bitfield caption="Channel Duty-Cycle" mask="0x00FFFFFF" name="CDTY"/>
        </register>
        <register caption="PWM Channel Duty Cycle Update Register" name="PWM_CDTYUPD" offset="0x8" rw="W" size="4">
          <bitfield caption="Channel Duty-Cycle Update" mask="0x00FFFFFF" name="CDTYUPD"/>
        </register>
        <register caption="PWM Channel Period Register" name="PWM_CPRD" offset="0xC" rw="RW" size="4">
          <bitfield caption="Channel Period" mask="0x00FFFFFF" name="CPRD"/>
        </register>
