Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/1.1.115/PIC32CX-MTC/atdf/PIC32CX2051MTC128.atdf
      <value-group caption="Write Protection Key" name="SFR_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x534652"/>
      </value-group>
    </module>
    <module caption="Special Function Register Backup" name="SFRBU" id="04479" version="A">
      <register-group name="SFRBU">
        <register caption="XTAL Oscillator Trimming Register" name="SFRBU_XTAL_TRIM" offset="0x10" rw="RW" size="4">
          <bitfield caption="32 kHz Crystal Oscillator Trimming Value" mask="0x00000003" name="XTAL_TRIM"/>
        </register>
        <register caption="Trimming Bits Register" name="SFRBU_TRIM" offset="0x14" rw="R" size="4">
          <bitfield caption="RC Oscillator Trimming Value" mask="0x0000003F" name="RC32"/>
          <bitfield caption="Conversion IP Bandgap Trimming Value" mask="0x00000F00" name="CONVBG"/>
          <bitfield caption="Power Management IP LDO Trimming Value" mask="0x000F0000" name="LDO"/>
          <bitfield caption="LDO Internal Bandgap Trimming for LCD Driver" mask="0x0F000000" name="LCD"/>
        </register>
        <register caption="Boot Register" name="SFRBU_BOOT" offset="0x20" rw="RW" size="4">
          <bitfield caption="Source for Booting Sequence" mask="0x00000001" name="SOURCE"/>
        </register>
        <register caption="IO Retention Register" name="SFRBU_IO_RETENTION" offset="0x30" rw="RW" size="4">
          <bitfield caption="Keep Function on PA0 to PA7" mask="0x00000001" name="PA_7_0"/>
          <bitfield caption="Keep Function on PA8 to PA15" mask="0x00000002" name="PA_15_8"/>
          <bitfield caption="Keep Function on PA16 to PA23" mask="0x00000004" name="PA_23_16"/>
          <bitfield caption="Keep Function on PA24 to PA31" mask="0x00000008" name="PA_31_24"/>
          <bitfield caption="Keep Function on PB0 to PB7" mask="0x00000010" name="PB_7_0"/>
          <bitfield caption="Keep Function on PB8 to PB15" mask="0x00000020" name="PB_15_8"/>
          <bitfield caption="Keep Function on PB216 to PB23" mask="0x00000040" name="PB_23_16"/>
          <bitfield caption="Keep Function on PB24 to PB26" mask="0x00000080" name="PB_26_24"/>
          <bitfield caption="Keep Function on PC0 to PC7" mask="0x00000100" name="PC_7_0"/>
          <bitfield caption="Keep Function on PC8 to PC15" mask="0x00000200" name="PC_15_8"/>
          <bitfield caption="Keep Function on PC16 to PC22" mask="0x00000400" name="PC_22_16"/>
          <bitfield caption="Keep Function on PD0 to PD7" mask="0x00001000" name="PD_7_0"/>
          <bitfield caption="Keep Function on PD8 to PD15" mask="0x00002000" name="PD_15_8"/>
          <bitfield caption="Keep Function on PD16 to PD23" mask="0x00004000" name="PD_23_16"/>
          <bitfield caption="Keep Function on PD24 to PD30" mask="0x00008000" name="PD_30_24"/>
          <bitfield caption="Keep Function on NRST" mask="0x00010000" name="NRST"/>
        </register>
        <register caption="BOD Core Register" name="SFRBU_BODCORE" offset="0x40" rw="RW" size="4">
          <bitfield caption="Core Brownout Detector" mask="0x00000001" name="STATUS"/>
        </register>
        <register caption="Power Switch Control Register" name="SFRBU_PWS_CNTRL" offset="0x50" rw="RW" size="4">
          <bitfield caption="Unmask Power Switch Control Signals" mask="0x00000001" name="UNMASK"/>
        </register>
        <register caption="Write Protection Mode Register" name="SFRBU_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="SFRBU_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="SFRBU_WPSR" offset="0xE8" rw="RW" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Source" mask="0x00FFFF00" name="WPSRC"/>
        </register>
        <register caption="Spare Register" name="SFRBU_SPARE" offset="0xF0" rw="RW" size="4">
          <bitfield caption="Spare" mask="0xFFFFFFFF" name="VALUE"/>
        </register>
      </register-group>
      <value-group caption="Write Protection Key" name="SFRBU_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." name="PASSWD" value="0x534652"/>
      </value-group>
    </module>
    <module caption="Secure Hash Algorithm" name="SHA" id="6156" version="S">
      <register-group name="SHA">
        <register caption="Control Register" name="SHA_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Start Processing" mask="0x00000001" name="START"/>
          <bitfield caption="First Block of a Message" mask="0x00000010" name="FIRST"/>
          <bitfield caption="Software Reset" mask="0x00000100" name="SWRST"/>
          <bitfield caption="Write User Initial Hash Values" mask="0x00001000" name="WUIHV"/>
          <bitfield caption="Write User Initial or Expected Hash Values" mask="0x00002000" name="WUIEHV"/>
          <bitfield caption="Unlock Processing" mask="0x01000000" name="UNLOCK"/>
        </register>
        <register caption="Mode Register" name="SHA_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Start Mode" mask="0x00000003" name="SMOD" values="SHA_MR__SMOD"/>
          <bitfield caption="Always ON Enable" mask="0x00000008" name="AOE"/>
          <bitfield caption="Processing Delay" mask="0x00000010" name="PROCDLY" values="SHA_MR__PROCDLY"/>
          <bitfield caption="User Initial Hash Value Registers" mask="0x00000020" name="UIHV"/>
          <bitfield caption="User Initial or Expected Hash Value Registers" mask="0x00000040" name="UIEHV"/>
          <bitfield caption="Block Processing End" mask="0x00000080" name="BPE"/>
          <bitfield caption="SHA Algorithm" mask="0x00000F00" name="ALGO" values="SHA_MR__ALGO"/>
          <bitfield caption="Tamper Lock Enable" mask="0x00008000" name="TMPLCK"/>
          <bitfield caption="Dual Input Buffer" mask="0x00010000" name="DUALBUFF" values="SHA_MR__DUALBUFF"/>
          <bitfield caption="Hash Check" mask="0x03000000" name="CHECK" values="SHA_MR__CHECK"/>
          <bitfield caption="Check Counter" mask="0xF0000000" name="CHKCNT"/>
        </register>
        <register caption="Interrupt Enable Register" name="SHA_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00000002" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000004" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Enable" mask="0x00000100" name="URAD"/>
          <bitfield caption="Check Done Interrupt Enable" mask="0x00010000" name="CHECKF"/>
          <bitfield caption="Security and/or Safety Event Interrupt Enable" mask="0x01000000" name="SECE"/>
        </register>
        <register caption="Interrupt Disable Register" name="SHA_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable" mask="0x00000002" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00000004" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Disable" mask="0x00000100" name="URAD"/>
          <bitfield caption="Check Done Interrupt Disable" mask="0x00010000" name="CHECKF"/>
          <bitfield caption="Security and/or Safety Event Interrupt Disable" mask="0x01000000" name="SECE"/>
        </register>
        <register caption="Interrupt Mask Register" name="SHA_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask" mask="0x00000002" name="ENDTX"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00000004" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Mask" mask="0x00000100" name="URAD"/>
          <bitfield caption="Check Done Interrupt Mask" mask="0x00010000" name="CHECKF"/>
          <bitfield caption="Security and/or Safety Event Interrupt Mask" mask="0x01000000" name="SECE"/>
        </register>
        <register caption="Interrupt Status Register" name="SHA_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready (cleared by writing a 1 to bit SWRST or START in SHA_CR, or by reading SHA_IODATARx)" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of TX Buffer (cleared by writing SHA_TCR or SHA_TNCR)" mask="0x00000002" name="ENDTX"/>
          <bitfield caption="TX Buffer Empty (cleared by writing SHA_TCR or SHA_TNCR)" mask="0x00000004" name="TXBUFE"/>
          <bitfield caption="Input Data Register Write Ready" mask="0x00000010" name="WRDY"/>
          <bitfield caption="Unspecified Register Access Detection Status (cleared by writing a 1 to SWRST bit in SHA_CR)" mask="0x00000100" name="URAD"/>
          <bitfield caption="Unspecified Register Access Type (cleared by writing a 1 to SWRST bit in SHA_CR)" mask="0x00007000" name="URAT"/>
          <bitfield caption="Check Done Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx)" mask="0x00010000" name="CHECKF"/>
          <bitfield caption="Check Status (cleared by writing START or SWRST bits in SHA_CR or by reading SHA_IODATARx)" mask="0x00F00000" name="CHKST"/>
          <bitfield caption="Security and/or Safety Event" mask="0x01000000" name="SECE"/>
        </register>
        <register caption="Message Size Register" name="SHA_MSR" offset="0x20" rw="RW" size="4">
          <bitfield caption="Message Size" mask="0xFFFFFFFF" name="MSGSIZE"/>
        </register>
